<a href="https://colab.research.google.com/github/jonathanahc/Practicas/blob/main/Pr%C3%A1ctica17_Limpieza_y_Transformaci%C3%B3n_de_Datos_Categ%C3%B3ricos.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
from google.colab import drive
drive.mount('/content/drive')

import pandas as pd

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [67]:
df = pd.read_csv('/content/drive/MyDrive/Unidad02/nls97.csv', index_col=0, engine="python")
df.head()

,gender,birthmonth,birthyear,highestgradecompleted,maritalstatus,childathome,childnotathome,wageincome,weeklyhrscomputer,weeklyhrstv,...,colenrfeb13,colenroct13,colenrfeb14,colenroct14,colenrfeb15,colenroct15,colenrfeb16,colenroct16,colenrfeb17,colenroct17
personid,,,,,,,,,,,,,,,,,,,,,
100061,Female,5,1980,13.0,Married,4.0,0.0,12500.0,10 hours or more a week,11 to 20 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
100139,Male,9,1983,12.0,Married,2.0,0.0,120000.0,1 to 3 hours a week,3 to 10 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
100284,Male,11,1984,7.0,Never-married,1.0,0.0,58000.0,NaN,11 to 20 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
100292,Male,4,1982,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,NaN,NaN,NaN,NaN
100583,Male,1,1980,13.0,Married,4.0,0.0,30000.0,Less than 1 hour a week,3 to 10 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled

# Ejercicio 01: Errores Tipográficos y Valores Inconsistentes: maritalstatus

**Imprime de la columna 'maritalstatus' los valores únicos**

In [68]:
print(df['maritalstatus'].unique())

['Married' 'Never-married' nan 'Divorced' 'Separated' 'Widowed']

**Imprime la frecuencia de cada valor único**

In [69]:
df['maritalstatus'].value_counts()

maritalstatus
Married          3066
Never-married    2766
Divorced          663
Separated         154
Widowed            23
Name: count, dtype: int64

**Cambia el valor 'Never-Married' a 'Single'**

In [70]:
df['maritalstatus'] = df['maritalstatus'].replace('Never-married','Single')

**Imprime la frecuencia de cada valor único**

In [71]:
df['maritalstatus'].value_counts()

maritalstatus
Married      3066
Single       2766
Divorced      663
Separated     154
Widowed        23
Name: count, dtype: int64

# Ejercicio 02: Errores Tipográficos y Valores Inconsistentes: highestdegree

**Imprime de la columna 'highestdegrees' los valores únicos**

In [72]:
print(df['highestdegree'].unique())

['2. High School' '0. None' '4. Bachelors' '3. Associates' '5. Masters'
 '1. GED' '7. Professional' '6. PhD' nan]

**Imprime la frecuencia de cada valor único**

In [73]:
df['highestdegree'].value_counts()

highestdegree
2. High School     3667
4. Bachelors       1673
1. GED             1146
0. None             953
3. Associates       737
5. Masters          603
7. Professional     120
6. PhD               54
Name: count, dtype: int64

**Observa que cada valor categórico empieza con 0. Modifica las categorías para que todas estén en minúsculas y ninguna empiece con un número. Por ejemplo, si dice "2. High School", debería ser 'high school**

In [74]:
df['highestdegree'] = df['highestdegree'].str.lower().str.replace(r'^\d+\.\s*', '', regex=True)

**Imprime los nuevos valores únicos**

In [75]:
print(df['highestdegree'].unique())

['high school' 'none' 'bachelors' 'associates' 'masters' 'ged'
 'professional' 'phd' nan]

# Ejercicio 03: Alta Cardinalidad - Frecuencias Bajas

**De la columna 'maritalstatus' une las categorías Widowed y 'Single' en una categoría más general llamada 'Single/No Partner'. Crea una nueva columna, 'marital_grouped' donde aparezcan las nuevas categorías de maritalstatus**

In [76]:
df['maritalstatus'] = df['maritalstatus'].copy()

df['marital_grouped'] = df['maritalstatus'].replace(['Widowed', 'Single'], 'Single/No Partner')

**Imprime los valores únicos de la nueva columna 'marital_grouped'**

In [77]:
print(df['marital_grouped'].unique())

['Married' 'Single/No Partner' nan 'Divorced' 'Separated']

**Imprime la frecuencia de los valores únicos de la nueva columna 'marital_grouped'**

In [78]:
df['marital_grouped'].value_counts()

marital_grouped
Married              3066
Single/No Partner    2789
Divorced              663
Separated             154
Name: count, dtype: int64

# Ejercicio 04: Tipos de Datos

**Imprime el tipo de datos de la columna gender**

In [79]:
print(df['gender'].dtype)

object

**Imprime la cantidad de bytes de dicha columna**

In [80]:
print(f"Memoria:", df['gender'].memory_usage(deep=True))

Memoria: 628666

**Si la columna es de tipo object, modifica a category**

In [81]:
df['gender'] = df['gender'].astype('category')
print(df['gender'].dtype)

category

**En caso de haber realizado la modificación del tipo de datos, imprime la cantidad de bytes que ocupa dicha columna con el nuevo tipo de datos**

In [82]:
print(f"Memoria:", df['gender'].memory_usage(deep=True))

Memoria: 81088